mainconf/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

mainconf/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Абонементы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

mainconf/HTTPServices/users/Ext/Module.bsl
Функция getUserGET(Запрос)

	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); //(1)
    
    ЗапросПользователи = Новый Запрос;
    Если Логин <> "" Тогда //(2)
        ЗапросПользователи.Текст = "ВЫБРАТЬ
        |    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
        |    Пользователи.Наименование КАК Наименование,
        |    Пользователи.Код КАК Код
        |ИЗ
        |    Справочник.Пользователи КАК Пользователи
        |ГДЕ
        |    НЕ Пользователи.ПометкаУдаления
        |    И Пользователи.Наименование = &Наименование
        |
        |УПОРЯДОЧИТЬ ПО
        |    Наименование";
        
        ЗапросПользователи.УстановитьПараметр("Наименование", Логин); //(3)
    Иначе //(4)
        ЗапросПользователи.Текст = "ВЫБРАТЬ
        |    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
        |    Пользователи.Наименование КАК Наименование,
        |    Пользователи.Код КАК Код
        |ИЗ
        |    Справочник.Пользователи КАК Пользователи
        |ГДЕ
        |    НЕ Пользователи.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |    Наименование";
        
    КонецЕсли;    
    
    РезультатЗапроса = ЗапросПользователи.Выполнить();
	МассивПользователей= Новый Массив; //1

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

	    ДанныеПользователя = Новый Структура; //2
	    ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
	    ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
	    ДанныеПользователя.Вставить("code", Строка(Выборка.Код));

	    МассивПользователей.Добавить(ДанныеПользователя); //3

	КонецЦикла;

	Ответ = Новый HTTPСервисОтвет(200); //4

	ЗаписьJSON = Новый ЗаписьJSON; //5
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
	СтрокаОтвета = ЗаписьJSON.Закрыть();

	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); //6

	Возврат Ответ; //7

КонецФункции

Функция regUserREG(Запрос) 
	
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = ДанныеЗапроса.Логин;
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.Администратор);
    НовыйПользовательИБ.Записать();
	
	НовыйПолбзовательСправочника = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПолбзовательСправочника.Код = НовыйПользовательИБ.УникальныйИдентификатор;
	НовыйПолбзовательСправочника.Наименование = ДанныеЗапроса.Логин;
	НовыйПолбзовательСправочника.Записать();
	
	НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКлиент.Родитель = ПредопределенноеЗначение("Справочник.Контрагенты.Клиенты");
	НовыйКлиент.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент");
	НовыйКлиент.Наименование = ДанныеЗапроса.Логин;
	НовыйКлиент.КонтактныйТелефон = ДанныеЗапроса.Телефон;
	НовыйКлиент.Комментарий = СтрШаблон("клиент из мобильного приложения");
	НовыйКлиент.Записать();
	
	НовыйПолбзовательСправочника.Клиент = НовыйКлиент.Ссылка;


	Попытка
		НовыйПолбзовательСправочника.Записать();
	    ТекстОтвета = "Получилось";
	    Ответ = Новый HTTPСервисОтвет(200);
	Исключение
		НовыйПолбзовательСправочника.Записать();
	    Ответ = Новый HTTPСервисОтвет(500);
	    ТекстОтвета = "НЕ получилось";
	КонецПопытки;

	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);

	Возврат Ответ; 

КонецФункции
